Revit 2027 API
ExporterIFCUtils.GetMinSymbolWidth Method
 Obtains the minimum width of the given FamilySymbol.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static double GetMinSymbolWidth(
	FamilySymbol symbol
)
Public Shared Function GetMinSymbolWidth (
	symbol As FamilySymbol
) As Double
public:
static double GetMinSymbolWidth(
	FamilySymbol^ symbol
)
static member GetMinSymbolWidth :
        symbol : FamilySymbol -> float
Parameters
symbol FamilySymbol
 The family symbol.
Return Value
Double
 The minimum width.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace